Tekla.Structures.Geometry3d.LineConversions
The Tekla.Structures.Geometry3d.LineConversions class converts structures representing lines
from Tekla.Structures.Geometry3d to Tekla.Common.Geometry and back.

Tekla.Structures.Geometry3d.LineConversions.ToLine3(Tekla.Structures.Geometry3d.Line)
Converts a Tekla.Structures.Geometry3d.Line to a Tekla.Common.Geometry.Line3.
line: The Tekla.Structures.Geometry3d.Line to convert.
Returns: The resulting Tekla.Common.Geometry.Line3.

Tekla.Structures.Geometry3d.LineConversions.ToLine3List(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Line})
Creates a list of Tekla.Common.Geometry.Line3 values from an System.Collections.Generic.IEnumerable`1 of Tekla.Structures.Geometry3d.Line values.
lines: The collection of Tekla.Structures.Geometry3d.Line values to convert.
Returns: The resulting list of Tekla.Common.Geometry.Line3 values.

Tekla.Structures.Geometry3d.LineConversions.ToLine(Tekla.Common.Geometry.Line3)
Converts a Tekla.Common.Geometry.Line3 to a Tekla.Structures.Geometry3d.Line.
line: The Tekla.Common.Geometry.Line3 to convert.
Returns: The resulting Tekla.Structures.Geometry3d.Line.

Tekla.Structures.Geometry3d.LineConversions.ToLineList(System.Collections.Generic.IEnumerable{Tekla.Common.Geometry.Line3})
Creates a list of Tekla.Structures.Geometry3d.Line values from an System.Collections.Generic.IEnumerable`1 of Tekla.Common.Geometry.Line3 values.
lines: The collection of Tekla.Common.Geometry.Line3 values to convert.
Returns: The resulting list of Tekla.Structures.Geometry3d.Line values.